# FilterOperatorAndTextString Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterOperatorAndTextString Members
FilterOperatorAndTextString Class Methods Properties See Also
---
The FilterOperatorAndTextString type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FilterOperatorAndTextString |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterOperatorStr | A text string denoting the filter operator. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OperatorType | The filter operator. |

# See Also
FilterOperatorAndTextString Class
Autodesk.Revit.DB Namespace